# Assignment 6:  Due Thursday 10/10

In this assignment you will become familiar with the Pandas library through the exploration of a Nobel prize data set. 

This data set was taken from the Kaggle website (https://www.kaggle.com/). If you are interested in data science and / or analysis, this website offers tons of data sets in various formats that you can access. They even post compititions that you can enter, some with money prizes awarded.

The libraries needed for this assignment are listed below.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

# 1a)

Read in the data set 'data/nobel.csv' into a DataFrame using Pandas .

In [12]:
inpath = %pwd
print(inpath)
infile = inpath + '/data/nobel.csv'
print(infile)
df = pd.read_csv(infile)

/Users/elliehan/PHYS3511/Phys-3511-Fall24/Module06/Assignment
/Users/elliehan/PHYS3511/Phys-3511-Fall24/Module06/Assignment/data/nobel.csv

# 1b)

Display below the output from the DataFrame functions *info*.

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 18 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  911 non-null    int64
 1   category              911 non-null    object
 2   prize                 911 non-null    object
 3   motivation            823 non-null    object
 4   prize_share           911 non-null    object
 5   laureate_id           911 non-null    int64
 6   laureate_type         911 non-null    object
 7   full_name             911 non-null    object
 8   birth_date            883 non-null    object
 9   birth_city            883 non-null    object
 10  birth_country         885 non-null    object
 11  sex                   885 non-null    object
 12  organization_name     665 non-null    object
 13  organization_city     667 non-null    object
 14  organization_country  667 non-null    object
 15  death_date            593 non-null    object
 16  death_city            576 non-null    object
 17  death_country         582 non-null    object
dtypes: int64(2), object(16)
memory usage: 128.2+ KB

# 1c)

Show the first 5 listings of the dataset.

In [20]:
df.head(5)

,year,category,prize,motivation,prize_share,laureate_id,laureate_type,full_name,birth_date,birth_city,birth_country,sex,organization_name,organization_city,organization_country,death_date,death_city,death_country
0,1901,Chemistry,The Nobel Prize in Chemistry 1901,"""in recognition of the extraordinary services ...",1/1,160,Individual,Jacobus Henricus van 't Hoff,1852-08-30,Rotterdam,Netherlands,Male,Berlin University,Berlin,Germany,1911-03-01,Berlin,Germany
1,1901,Literature,The Nobel Prize in Literature 1901,"""in special recognition of his poetic composit...",1/1,569,Individual,Sully Prudhomme,1839-03-16,Paris,France,Male,NaN,NaN,NaN,1907-09-07,Châtenay,France
2,1901,Medicine,The Nobel Prize in Physiology or Medicine 1901,"""for his work on serum therapy, especially its...",1/1,293,Individual,Emil Adolf von Behring,1854-03-15,Hansdorf (Lawice),Prussia (Poland),Male,Marburg University,Marburg,Germany,1917-03-31,Marburg,Germany
3,1901,Peace,The Nobel Peace Prize 1901,NaN,1/2,462,Individual,Jean Henry Dunant,1828-05-08,Geneva,Switzerland,Male,NaN,NaN,NaN,1910-10-30,Heiden,Switzerland
4,1901,Peace,The Nobel Peace Prize 1901,NaN,1/2,463,Individual,Frédéric Passy,1822-05-20,Paris,France,Male,NaN,NaN,NaN,1912-06-12,Paris,France

# Problem 2

How many null ('NaN') values there are in each *catagory*? What is the total number of Null values in the DataFrame?

In [26]:
print(df.isna().sum())

year                      0
category                  0
prize                     0
motivation               88
prize_share               0
laureate_id               0
laureate_type             0
full_name                 0
birth_date               28
birth_city               28
birth_country            26
sex                      26
organization_name       246
organization_city       244
organization_country    244
death_date              318
death_city              335
death_country           329
dtype: int64

     year   category                                              prize  \
0    1901  Chemistry                  The Nobel Prize in Chemistry 1901
2    1901   Medicine     The Nobel Prize in Physiology or Medicine 1901
5    1901    Physics                    The Nobel Prize in Physics 1901
6    1902  Chemistry                  The Nobel Prize in Chemistry 1902
8    1902   Medicine     The Nobel Prize in Physiology or Medicine 1902
..    ...        ...                                                ...
819  2009  Economics  The Sveriges Riksbank Prize in Economic Scienc...
827  2009    Physics                    The Nobel Prize in Physics 2009
833  2010  Economics  The Sveriges Riksbank Prize in Economic Scienc...
836  2010   Medicine     The Nobel Prize in Physiology or Medicine 2010
856  2012  Economics  The Sveriges Riksbank Prize in Economic Scienc...

                                            motivation prize_share  \
0    "in recognition of the extraordinary services ...         1/1
2    "for his work on serum therapy, especially its...         1/1
5    "in recognition of the extraordinary services ...         1/1
6    "in recognition of the extraordinary services ...         1/1
8    "for his work on malaria, by which he has show...         1/1
..                                                 ...         ...
819  "for her analysis of economic governance, espe...         1/2
827  "for the invention of an imaging semiconductor...         1/4
833  "for their analysis of markets with search fri...         1/3
836    "for the development of in vitro fertilization"         1/1
856  "for the theory of stable allocations and the ...         1/2

     laureate_id laureate_type                     full_name  birth_date  \
0            160    Individual  Jacobus Henricus van 't Hoff  1852-08-30
2            293    Individual        Emil Adolf von Behring  1854-03-15
5              1    Individual        Wilhelm Conrad Röntgen  1845-03-27
6            161    Individual          Hermann Emil Fischer  1852-10-09
8            294    Individual                   Ronald Ross  1857-05-13
..           ...           ...                           ...         ...
819          846    Individual                 Elinor Ostrom  1933-08-07
827          839    Individual              Willard S. Boyle  1924-08-19
833          857    Individual             Dale T. Mortensen  1939-02-02
836          848    Individual             Robert G. Edwards  1925-09-27
856          883    Individual              Lloyd S. Shapley  1923-06-02

             birth_city             birth_country     sex  \
0             Rotterdam               Netherlands    Male
2     Hansdorf (Lawice)          Prussia (Poland)    Male
5    Lennep (Remscheid)         Prussia (Germany)    Male
6            Euskirchen         Prussia (Germany)    Male
8                Almora                     India    Male
..                  ...                       ...     ...
819     Los Angeles, CA  United States of America  Female
827         Amherst, NS                    Canada    Male
833      Enterprise, OR  United States of America    Male
836              Batley            United Kingdom    Male
856       Cambridge, MA  United States of America    Male

            organization_name organization_city      organization_country  \
0           Berlin University            Berlin                   Germany
2          Marburg University           Marburg                   Germany
5           Munich University            Munich                   Germany
6           Berlin University            Berlin                   Germany
8          University College         Liverpool            United Kingdom
..                        ...               ...                       ...
819        Indiana University   Bloomington, IN  United States of America
827         Bell Laboratories   Murray Hill, NJ  United States of America
833   Northwestern University      Evanston, IL  United States of America
836   University of Cambridge         Cambridge            United Kingdom
856  University of California   Los Angeles, CA  United States of America

     death_date       death_city             death_country
0    1911-03-01           Berlin                   Germany
2    1917-03-31          Marburg                   Germany
5    1923-02-10           Munich                   Germany
6    1919-07-15           Berlin                   Germany
8    1932-09-16     Putney Heath            United Kingdom
..          ...              ...                       ...
819  2012-06-12  Bloomington, IN  United States of America
827  2011-05-07        Truro, NS                    Canada
833  2014-01-09     Wilmette, IL  United States of America
836  2013-04-10        Cambridge            United Kingdom
856  2016-03-12       Tucson, AZ  United States of America

[404 rows x 18 columns]

# Problem 3

Make a histogram of the number of nobel prizes awarded per year. Around which decade (1900, 1910, 1920, ...) were the least amount of prizes awarded?

# Problem 4

Use groupby method to printout the number of prizes awarded to each category. Which categroy has the most prizes?

# Problem 5

Find percentage of the prizes were awarded to 1, 2, 3, and 4 people? Meaning what percentage of 1/1, 1/2, 1/3, and 1/4 prize_shares are there?

# Problem 6

Determine how many males and females won the prize. Does the sum of male and female prizes add up to the total entries? If not, why?

On the same graph make histograms for the numbber of males and females that won the prize each year.

# Problem 7

How many prizes were won by those whose birth country was United States of America?

# Problem 8

Determine the age that each of the prize winners was when they won the prize. Find the youngest and oldest to win the prize. Find the mean age to win the prize, and the standard deviation of it. Make a histogram of the age each person was when they won the prize.

### Hint: You can use Pandas DatetimeIndex method to extract the year from the date format yyyy-mm-dd
> pd.DatetimeIndex(date).year

Where *date* is given in a formate like year-month-day, the above will returen the year, hence the *.year* in the call above. Use 'shit+tab' on pandas.DatetimeIndex to learn more.

# Problem 9

Make a copy of the current DataFrame. Then drop the column *lauret_id* from the copied DataFrame (do this inplace so this column is gone).

# Problem 10

Add the age column you calculated in Problem 8 to the DataFrame.